import React from 'react';
import './PrivacyPloicy.css'; 
import DiyarahLogo from '/icons/SpportSphere.png'

import Header from '../../components/Layout/Header'
import HeroSection from '../../components/Other/HeroSection';
import Footer from '../../components/Layout/Footer';
import Up from '../../components/Other/Up';

const PrivacyPolicy = () => {
  return (
    <>
      <div className='overlay-image'></div>
      <Header />
      <HeroSection />
      <Up />
      <div className="privacy-policy-container">
        <header>
          <h1 className="privacy-policy-title">سياسة الخصوصية</h1>
          <p>
            نحن في <strong>نطاق الدعم</strong> نولي أهمية كبيرة لخصوصية بيانات عملائنا وورش التصليح والمشرفين. 
            تهدف هذه السياسة إلى توضيح كيفية جمع، استخدام، وحماية البيانات الشخصية التي يتم تزويدنا بها عند استخدام منصتنا.
          </p>
          <p>باستخدامك لمنصتنا، فإنك توافق على ممارسات جمع واستخدام المعلومات كما هو موضح في هذه السياسة. إذا كنت لا توافق على أي من بنود هذه السياسة، نوصي بعدم استخدام خدماتنا.</p>
        </header>
        <section>
          <h2>1. المعلومات التي نجمعها</h2>
          <h3>1.1 المعلومات الشخصية</h3>
          <p>قد نقوم بجمع المعلومات الشخصية التالية عند تسجيلك واستخدامك لمنصتنا:</p>
          <ul>
              <li>- الاسم: للتعرف عليك وتخصيص الخدمات المقدمة لك.</li>
              <li>- البريد الإلكتروني: لإرسال إشعارات ومراسلات متعلقة بالخدمات.</li>
              <li>- رقم الهاتف: للتواصل السريع بشأن حالتك أو مشكلتك المقدمة.</li>
              <li>- العنوان: لاستخدامه عند طلب خدمة من ورشة متنقلة أو لحجز الورشة المناسبة بالقرب منك.</li>
          </ul>

          <h3>1.2 المعلومات غير الشخصية</h3>
          <p>نقوم بجمع معلومات غير شخصية لتحسين تجربة المستخدم ومتابعة الأداء العام للمنصة، مثل:</p>
          <ul>
              <li>- الموقع الجغرافي العام لتحسين اقتراح الورش القريبة.</li>
              <li>- نوع الجهاز والمتصفح لتحسين توافق المنصة مع الأجهزة المختلفة.</li>
              <li>- سجل الاستخدام لمعرفة كيفية استخدامك للخدمات التي نقدمها.</li>
          </ul>
        </section>

        <section>
          <h2>2. كيفية استخدام المعلومات</h2>
          <p>
              نستخدم المعلومات الشخصية لتحسين تجربتك على المنصة، بما في ذلك تخصيص العروض المقدمة، اقتراح الورش المناسبة، 
              والتواصل معك بشأن طلباتك. نستخدم أيضًا بياناتك لضمان سلامة وأمن النظام، ومنع أي عمليات غير قانونية أو احتيالية على المنصة.
          </p>
        </section>
        <section>
          <h2>3. مشاركة المعلومات مع أطراف ثالثة</h2>
          <h3>3.1 ورش التصليح</h3>
          <p>عند تقديمك لمشكلة، سيتم مشاركة بيانات معينة مع ورش التصليح التي تقدم عروضها.</p>

          <h3>3.2 المشرفون</h3>
          <p>المشرفون على المنصة لديهم حق الوصول إلى المعلومات المقدمة لتحليل المشكلة وكتابة تقارير دقيقة.</p>

          <h3>3.3 أطراف ثالثة أخرى</h3>
          <p>لن نشارك معلوماتك مع أطراف ثالثة لأغراض تجارية دون موافقتك. قد يتم مشاركة بعض البيانات إذا طُلب منا قانونياً.</p>
        </section>
        <section>
          <h2>4. حماية المعلومات</h2>
          <p>
              نحن ملتزمون بحماية بياناتك من الوصول غير المصرح به أو الاستخدام غير القانوني. نستخدم إجراءات أمان متقدمة، مثل التشفير، الجدران النارية، وأنظمة مراقبة الأمان.
          </p>
        </section>
        <section>
          <h2>5. حقوق المستخدمين</h2>
          <ul>
              <li>- الحق في الوصول إلى المعلومات.</li>
              <li>- الحق في تصحيح أو تحديث المعلومات.</li>
              <li>- الحق في طلب حذف البيانات.</li>
              <li>- الحق في إلغاء الاشتراك من رسائل البريد الإلكتروني التسويقية.</li>
          </ul>
        </section>
        <section>
          <h2>6. ملفات تعريف الارتباط (Cookies)</h2>
          <p>
              نستخدم ملفات تعريف الارتباط لتحسين تجربتك على الموقع. تساعدنا هذه الملفات في تتبع أنشطة الزوار على الموقع وتحديد كيف يمكننا تحسين تجربة المستخدم.
          </p>
        </section>
        <section>
          <h2>7. التغييرات على سياسة الخصوصية</h2>
          <p>قد نقوم بتحديث سياسة الخصوصية من وقت لآخر. سيتم إشعارك بأي تغييرات كبيرة عبر البريد الإلكتروني أو عبر إشعار على المنصة.</p>
        </section>

        <div id='plogoDiv'>
          <img src={DiyarahLogo} alt="Company Logo" className="plogo" loading="lazy" />
        </div>
      </div>
      <Footer />
    </>
  );
};

export default PrivacyPolicy;
